# RampAttrMinInvSlope Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RampAttrMinInvSlope Property
ParameterTypeId Class See Also
---
"Ramp Max Slope (1/x)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RampAttrMinInvSlope { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RampAttrMinInvSlope As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RampAttrMinInvSlope {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace